app/Validations/UserRules.php

    public function validateUser( string $str, string $fields, array $data )
    {
        $userModel  =   new UserModel();

        $user       =   $userModel->where( 'email', $data['emailFrm'] )->first();
---
SELECT *
FROM `users`
WHERE `email` = 'miguel@gmail.com'
 LIMIT 1