app/Controllers/Dashboard.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users  =   $this->userModel->asObject()->findAll();