app/Controllers/UserController.php

                $data['validation'] =   $this->validator;
            }else
                {
                    $user   =   $this->userModel->where( 'email', $this->request->getPost('emailFrm') )->first();
---
SELECT *
FROM `users`
WHERE `email` = 'miguel@gmail.com'
 LIMIT 1

                    'password'      =>  $this->request->getVar( 'pwdFrm' ),
                ];

                $this->userModel->save( $newData );
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `created_at`) VALUES ('Miguelas', 'Santisteban', 'miguel@gmail.com', '$2y$10$Sbo2Y.Q2pO5fBqODDdxeaOVzZwQt2kIaqNM.A4ihhmV2RNOgBo1NW', '2025-08-17 14:43:24')